<template>
  <div style="padding: 10px 15px;">
    <div v-if="type == 'private'">
      <div style="text-align: center;padding: 20px 0;font-size: 17px;font-weight: bold;">火把平台用户隐私条款</div>
      <div style="padding: 10px 0;">
        需要特别说明的是，本政策仅针对于火把的行为，
        <span
          style="text-decoration: underline;"
        >若您是通过火把开放API/SDK接口在第三方平台或渠道使用或购买平台的知识内容的，第三方行为的约束以其平台公示的相关政策或您与第三方平台签署的相关协议约定为准，火把不承担第三方平台的任何行为导致的任何责任。</span>
      </div>
      <div style="padding: 10px 0;">
        <span
          style="font-weight: bold;text-decoration: underline;"
        >请您在使用杭州火把文化创意有限公司（以下亦称“火把”）所有平台和/或服务前，完整阅读并透彻理解本政策，并在您充分理解并同意后使用火把的平台及服务。如果您不同意本政策的任何内容，您应立即停止使用火把的平台和/或服务。当您使用火把的任一平台和/或服务时，则表示您同意且完全理解本个人信息保护政策的全部内容。</span>此外，若您在使用知识服务时主动或应他人需求决定提供个人信息的，一切风险、后果及责任由您和主播方自行承担。
      </div>
      <div
        style="padding: 10px 0;"
      >火把可能需要搜集能识别用户身份的个人信息以便可以在必要时联系用户，或为用户提供更好的使用体验。“个人信息”包括但不限于用户的姓名、性别、年龄、出生日期、联系电话、身份证号、地址、受教育情况、公司情况、所属行业、兴趣爱好、所处位置信息、个人说明、手机软硬件信息、手机识别码等。</div>
      <div style="padding: 10px 0;">火把承诺，不以非法方式披露您依照火把规定的方式标明应予保密的用户个人信息。</div>
      <div style="padding: 10px 0;">您了解并同意，火把可依照法律或司法、行政机关的强制性命令对第三方合法披露您的个人信息且无需事先向您发出通知。</div>
      <div style="padding: 10px 0;">您了解并同意，当您购买在火把列出的商品或服务时，您的信息将被提供前述商品或服务的商家收集，您应自行承担此类信息披露的责任。</div>
      <div style="padding: 10px 0;">您了解并同意，火把在下述情形下可利用您的个人信息：</div>
      <div style="padding: 10px 0;">1） 在紧急情况下，为维护用户及公众的权益而使用。</div>
      <div style="padding: 10px 0;">2） 为维护火把的著作权、商标权、专利权及其他任何合法权利或权益并通知用户后使用。</div>
      <div
        style="padding: 10px 0;"
      >3） 在进行促销或抽奖时，火把可能会与赞助商共享用户的个人信息，在这些情况下火把会在发送用户信息之前进行提示，并且用户可以通过明确表示不参与活动而终止传送过程。</div>
      <div style="padding: 10px 0;">4） 获得用户许可后，为获取第三方数据而将用户信息与第三方数据匹配</div>
      <div style="padding: 10px 0;">5） 将用户数据用于统计，以便向未来的合作伙伴、广告商及其他第三方以及为了其他合法目的而描述火把的服务。</div>
      <div style="padding: 10px 0;">
        【审慎提醒】
        <span
          style="font-weight: bold;text-decoration: underline;"
        >如您使用火把或进行用户注册的，将视为您已同意前述服务使用协议及个人信息保护政策，该等条款将立即生效，并构成您和杭州火把文化创意有限公司及其经营的平台之间有约束力的法律文件。</span>
      </div>
      <div style="padding: 10px 0;">请您再次确认您已全部阅读并充分理解上述协议。</div>
    </div>
    <div v-else>
      <div style="text-align: center;padding: 20px 0;font-size: 17px;font-weight: bold;">火把平台用户注册协议</div>
      <!-- <div style="font-weight: bold;padding: 10px 0;">以下包含服务使用协议及个人隐私保护政策两部分：</div> -->

      <div style="padding: 10px 0;">第一条【重要提示】</div>
      <div style="padding: 10px 0;">请您（以下亦称“用户”）仔细阅读本协议全部条款，并确认您已完全了解本协议之规定。</div>
      <div style="padding: 10px 0;">未成年人应当在监护人陪同和指导下阅读本协议，并在使用本协议项下服务前取得监护人的同意。</div>
      <div style="padding: 10px 0;">
        请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。
        <span
          style="font-weight: bold;"
        >您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束，本协议将构成您与杭州火把文化创意有限公司（以下亦称“火把）之间直接有约束力的法律文件。</span>
      </div>

      <div style="padding: 10px 0;">第二条【充分授权】</div>
      <div
        style="padding: 10px 0;"
      >请确认您依照中华人民共和国法律（为本协议之目的，含行政法规、部门规章、规范性文件，下同）、及您所在地之法律、及您自愿或应当接收其管辖之法律（以下合称“法律”），有权签署并同意接受本协议的约束。如果您代表您的雇主或单位，请在签署前，确认并保证您已获得签署本协议的充分授权。</div>

      <div style="padding: 10px 0;">第三条【协议变更】</div>
      <div style="padding: 10px 0;">
        考虑到互联网服务不断高速发展和演进，
        <span
          style="font-weight: bold;text-decoration: underline;"
        >您同意火把有权利对本协议进行修改，协议修改后，火把将提前在相关页面公布修改的内容，并向您注册时提供的通讯工具发送通知或者以其他任何合理方式通知您，您同意承担及时阅读、提出意见和确认修改协议的义务。如果您不同意协议的最终修改，请立即停止访问和使用本网站并取消已经获得的服务；如果您选择在本协议修改后继续访问或使用本网站，则视为您已接受本协议的修改。</span>
      </div>
      <div style="padding: 10px 0;">
        您与火把签署的本协议所列明的条款，并不能完全涵盖您与火把的所有权利和义务。
        <span
          style="font-weight: bold;text-decoration: underline;"
        >您同意火把提前公布的其他声明、规则等均视为本协议之补充协议，为本协议不可分割的组成部分，与本协议具有同等法律效力。</span>
      </div>

      <div style="padding: 10px 0;">第四条 【服务方式】</div>
      <div style="padding: 10px 0;">火把主要是一家网络服务提供商，可针对不同传播渠道用户提供内容服务，前述传播渠道包括但不限于：</div>
      <div style="padding: 10px 0;">1）火把自有的传播渠道；</div>
      <div style="padding: 10px 0;">2）火把提供的可以使用的其他传播渠道。</div>
      <div
        style="padding: 10px 0;"
      >除免费服务外，火把可能提供部分收费服务。您可以通过付费方式购买收费服务，具体方式为：通过网上银行或其它火把提供的付费途径支付一定数额的人民币，从而获得收费服务使用权限。对于收费服务，火把会在您使用之前给予明确的提示，只有根据提示确认同意按照前述支付方式支付费用并完成了支付行为，才能使用该等收费服务。支付行为的完成以银行或第三方支付平台生成“支付已完成”的确认通知为准。</div>
      <div style="padding: 10px 0;">您应了解火把可能对该等服务（含收费服务）进行更改、更新或提高，但火把无法保证您在原有的付费范围内使用完毕相应的收费服务的除外。</div>
      <div style="padding: 10px 0;">第五条【善意使用】</div>
      <div style="padding: 10px 0;">您同意，遵守法律及本协议规定，秉承善意使用火把的服务，且保证：</div>
      <div style="padding: 10px 0;">1） 不会利用火把进行非法活动、或进行侵犯他人权利或损害他人利益的活动；不会以非法方式获取或利用火把其他用户的信息。</div>
      <div
        style="padding: 10px 0;"
      >2） 不会以技术方式攻击或破坏或改变火把的部分或全部、或干扰其运行；不会以非法方式获取或使用火把的任何软件、代码或其他技术或商业信息；不会对火把运行的任何程序进行反向工程、反向编译、反向汇编或改写。</div>
      <div
        style="padding: 10px 0;"
      >3） 不会未经许可使用火把的网站名称、公司名称、商标、商业标识、网页版式或内容、或其他由火把享有知识产权或权利的信息或资料；不会侵犯火把的商标权、著作权、专利权、其他知识产权或其他合法权利或权益。不会以任何方式贬损火把的商业声誉。</div>
      <div style="padding: 10px 0;">4） 不会利用火把进行其他违背公序良俗的活动。</div>
      <div
        style="padding: 10px 0;"
      >您使用火把的记录，可能被保存作为对您不利的证据。火把也可能将您违反法律或侵犯第三方权利或权益的记录报告给行政主管部门、司法机关等。</div>

      <div style="padding: 10px 0;">第六条【账户的取得、使用及注销】</div>
      <div
        style="padding: 10px 0;"
      >您需要在火把注册一个账号，并按照火把的要求为该账号设置密码，才可以使用该账号登录并使用火把的服务。您可依照火把的要求修改您的账号密码，但不可修改账号。</div>
      <div
        style="padding: 10px 0;"
      >您注册账号时，应按照火把的提示及要求填写或提供资料、信息，并确保您的身份及资料信息的真实性、正确性及完整性；如果您的资料或信息发生变化，您应及时更改。</div>
      <div style="padding: 10px 0;">您同意并承诺：</div>
      <div style="padding: 10px 0;">1）不冒用他人信息注册帐号；</div>
      <div style="padding: 10px 0;">2）不在未经他人合法授权的情况下以他人名义注册帐号；</div>
      <div style="padding: 10px 0;">3）不使用色情、暴力或侮辱、诽谤他人等违反公序良俗的词语注册帐号。</div>
      <div
        style="padding: 10px 0;"
      >4）火把保留通过邮件和短信等形式，对本网站注册，购物用户发送订单信息、促销活动等告知服务的权利，若您不希望接收火把的邮件和短信，请根据邮件和短信中的自助退订方式进行退订处理或者提供您的邮箱号或者手机号码并联系客服进行退订处理。</div>
      <div style="padding: 10px 0;">
        <van-checkbox v-model="checked">是否同意</van-checkbox>
      </div>
      <div style="padding: 10px 0;">如您违反前述规定，火把有权随时拒绝您注册、使用该账号，或者限制您使用该账号，或者注销该账号。</div>
      <div
        style="padding: 10px 0;"
      >在您完成账号注册后，火把将向您提供帐号及初始密码信息，此后，您应自行保管及维持帐号及密码的安全。您应自行使用该账号，并对任何人利用您的帐号及密码所进行的活动负完全的责任。</div>
      <div
        style="padding: 10px 0;"
      >您应了解，在账号和密码匹配时，火把无法对非法或未经您授权使用您帐号及密码的行为作出甄别，因此，火把对任何使用您账号和密码登录并使用火把的服务的行为不承担任何责任。</div>
      <div style="padding: 10px 0;">您同意并承诺：</div>
      <div style="padding: 10px 0;">1） 当您的帐号或密码遭到未获授权的使用，或者发生其他任何安全问题时，您会立即有效通知到火把；</div>
      <div style="padding: 10px 0;">2） 当您每次上网或使用其他服务完毕后，会将有关帐号等安全退出；</div>
      <div style="padding: 10px 0;">
        您有权注销您的账户，当您需要注销账户时，请您联系平台客服帮您处理。
        <span
          style="font-weight: bold;text-decoration: underline;"
        >请您知悉，您的账户一旦被注销后将造成您无法继续使用您已购买的付费内容或上传内容等，您同意一切后果由您自行承担。</span>
      </div>

      <div style="padding: 10px 0;">第七条【用户的权利与义务】</div>
      <div style="padding: 10px 0;">1）用户有权在注册后获得其个人的平台账号；</div>
      <div style="padding: 10px 0;">2）用户有权在注册并登陆后通过其个人的平台账号享受火把平台内的服务等；</div>
      <div style="padding: 10px 0;">3）用户有权在注册并登陆后，根据平台的规定，参与平台的线上或线下活动并取得火把给予的奖励等；</div>
      <div style="padding: 10px 0;">4）用户有权在注册并登陆后，根据平台的规定，参与平台的商业性项目，通过平台提供的增值化服务取得经济收益。</div>
      <div
        style="padding: 10px 0;font-weight: bold;text-decoration: underline;"
      >用户承诺并保证遵守《中华人民共和国著作权法》、《中华人民共和国商标法》、《中华人民共和国反不正当竞争法》、《中华人民共和国侵权责任法》、《中华人民共和国广告法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》及《信息网络传播权保护条例》等有关法律、法规、规章的规定。在任何情况下，火把合理的认为用户违反上述法律、法规、规章的规定且有相关依据的，可直接终止向该用户提供服务。</div>
      <div
        style="padding: 10px 0;font-weight: bold;text-decoration: underline;"
      >用户承诺并保证，用户对其在平台上传的文字、图片、视频、音频、多媒体资料或其他内容拥有相应合法的权利。上述文字、图片、视频、音频、多媒体资料或其他内容，不侵犯任何第三方的肖像权、名誉权、著作权、商标权等权利；不违反用户与第三方所签订的对用户有约束力的法律文件的规定；否则，火把有权对用户发布的信息依法或依据本协议进行删除或屏蔽，并有权不经事先通知终止向该用户提供服务。</div>
      <div style="padding: 10px 0;font-weight: bold;text-decoration: underline;">禁止用户从事以下行为：</div>
      <div
        style="padding: 10px 0;"
      >1)涉及危害国家安全、泄露国家秘密的，侵犯国家社会集体的和公民的合法权益的，制作、复制、发行或传播带有煽动抗拒、破坏法律、法规实施的，煽动颠覆国家政权，推翻社会主义制度的，煽动分裂国家、破坏国家统一的，煽动民族仇恨、民族歧视，破坏民族团结的，捏造或者歪曲事实，散布谣言，扰乱社会秩序的，宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的，公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的，损害国家机关信誉的，其他违反法律、法规的内容。</div>
      <div style="padding: 10px 0;">2)冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关的。</div>
      <div style="padding: 10px 0;">3)伪造标题或以其他方式操控识别资料，使人误认为该内容为火把所传送的。</div>
      <div
        style="padding: 10px 0;"
      >4)将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送。</div>
      <div
        style="padding: 10px 0;"
      >5)以技术方式攻击或破坏或改变平台的部分或全部、或干扰其运行；以非法方式获取或使用平台的任何软件、代码或其他技术或商业信息；禁止用户对平台运行的任何程序进行反向工程、反向编译、反向汇编或改写。</div>
      <div
        style="padding: 10px 0;"
      >6)未经许可使用平台的网站名称、公司名称、商标、商业标识、网页版式或内容、或其他由火把享有知识产权或权利的信息或资料；将平台以任何形式作为从事各种非法活动的场所、平台或媒介。未经火把的书面授权或许可，用户不得以火把的名义从事任何商业活动，也不得以任何形式将平台作为从事商业活动的场所、平台或媒介。</div>
      <div
        style="padding: 10px 0;"
      >7)未经火把书面许可、另行签署协议或另行指定可供用户使用的特定商业服务外，用户不得以商业目的使用平台；不对平台的任何部分或全部进行商业性质利用、复制、拷贝、出售、调查、广告。</div>
      <div style="padding: 10px 0;">8)未经火把书面许可、另行签署协议或另行指定可供用户使用的特定商业服务外，用户不得通过平台发布有关任意第三方的广告宣传内容。</div>
      <div
        style="padding: 10px 0;"
      >用户就其所上传的内容承担全部法律责任。因用户违反法律规定或本协议规定造成违约或侵犯第三方合法权益的，由用户自行解决。如果给火把造成损失，火把有权向用户追偿其因此所遭受的全部损失、包括其直接损失、间接损失、预期利益损失等损失。</div>
      <div style="padding: 10px 0;">第八条【用户产生的内容】</div>
      <div
        style="padding: 10px 0;"
      >用户在平台以各种形式发布的一切信息，均应符合国家法律法规等相关规定及网站相关规定，符合社会公序良俗，并不侵犯任何第三方主体的合法权益。火把有权随时检查用户所上传的内容，如果发现用户上传的内容不符合前述规定，火把有权删除或重新编辑用户所上传的内容。</div>

      <div style="padding: 10px 0;">
        火把有权基于合法性对用户上传的内容进行检查、编辑与修改。但是对于用户通过平台传播的内容，火把不保证其合法性、正当性、准确性或完整性。
        <span
          style="text-decoration: underline;"
        >在任何情况下，火把均不对用户上传的任何内容承担任何责任，包括但不限于由于任何内容而导致的直接或间接损失。用户应自行承担因此产生的一切法律后果，且火把因此受到的损失，有权向用户追偿。</span>
      </div>
      <div style="padding: 10px 0;">
        <span style="text-decoration: underline;">平台将尽可能保存用户上传的合法内容，但不承诺将为用户保存其上传的内容，用户应自行就前述内容备份。</span>
      </div>

      <div style="padding: 10px 0;">
        <span style="text-decoration: underline;">第九条</span>【知识产权】
      </div>
      <div
        style="padding: 10px 0;"
      >火把对其使用的软件所包含的受知识产权法或其他法律保护的资料享有相应的权利。火把的整体内容（包括但不仅限于设计图样以及其他图样、产品及服务名称）版权归火把所享有，任何人不得使用、复制或作其他用途。</div>
      <div
        style="padding: 10px 0;"
      >经由火把传送的文字、图片、音频、视频及其他内容，受到著作权法、商标法、专利法或其他法律的保护；未经火把书面授权许可，您不得自行或许可第三方进行修改、出租、售卖或衍生其他作品。</div>
      <div
        style="padding: 10px 0;"
      >火把对其专有内容、原创内容和其他通过授权取得的独占或者独家内容享有知识产权。未经书面许可，任何单位和个人不得私自转载、传播和提供收听服务或者有其他侵犯火把知识产权的行为。否则，将承担法律责任。</div>
      <div
        style="font-weight: bold;padding: 10px 0;"
      >为了促进知识的分享和传播，您将在火把上发表的全部内容（包括但不仅限于留言、评论和笔记），授予火把免费的、不可撤销的非独家使用许可权，火把有权将该内容用于各种形态的产品和服务上，包括但不限于火把以及发表的应用或其他互联网产品。</div>
      <div
        style="padding: 10px 0;"
      >您在火把上传或发表的内容，应保证您为著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益。如果第三方提出关于著作权的异议，火把有权根据实际情况删除相关的内容，且有权追究您的法律责任。给火把或任何第三方造成损失的，您应负责全额赔偿。</div>
      <div
        style="padding: 10px 0;"
      >火把有权对您发布的内容进行审核，有权根据相关证据结合《侵权责任法》、《信息网络传播权保护条例》等法律法规及火把学习小组指导原则对侵权信息进行处理。</div>

      <div style="padding: 10px 0;">
        <span style="text-decoration: underline;">第十条</span>【链接】
      </div>
      <div
        style="padding: 10px 0;"
      >为方便您使用，火把可能会提供第三方国际互联网网站或资源链接。您应了解，除非另有声明，火把无法对第三方网站服务进行控制。您因下载或传播或使用或依赖上述网站或资源所产生的损失或损害，应由您自行承担全部责任。</div>

      <div style="padding: 10px 0;">
        <span style="text-decoration: underline;">第十一条</span>【商业活动】
      </div>
      <div style="padding: 10px 0;">您了解并接受，火把为维护其运营和经营，可能进行下述商业活动：</div>
      <div style="padding: 10px 0;">1） 通过电子邮件、客户端、网页或其他合法方式向用户发送商品促销或其他相关商业信息。</div>
      <div style="padding: 10px 0;">2） 通过增值服务系统或其他方式向用户发送相关服务信息或其他信息，其他信息包括但不限于通知信息、宣传信息、广告信息等。</div>

      <div style="padding: 10px 0;">第十二条 【网络运行】</div>
      <div style="padding: 10px 0;">火把尽可能保证其网络的稳定运行。</div>
      <div style="padding: 10px 0;">您应理解并同意，因法律、政策、技术、经济、管理的原因，除非您和火把另有约定，火把不会因以下情形出现而对您承担责任：</div>
      <div style="padding: 10px 0;">1）火把因非自身原因无法使用或中断使用或无法完全适合用户的使用要求。</div>
      <div style="padding: 10px 0;">2）火把受到干扰，无法及时、安全、可靠运行，或出现任何错误。</div>
      <div style="padding: 10px 0;">3） 经由火把取得的任何产品、服务（含收费服务）或其他材料不符合您的期望。</div>
      <div style="padding: 10px 0;">4） 用户资料遭到第三方未经授权的使用或修改。</div>

      <div style="padding: 10px 0;">第十三条 【服务终止】</div>
      <div style="padding: 10px 0;">本协议或本协议项下火把所提供的服务（含收费服务）可在下述情形下部分或全部中止或终止：</div>
      <div style="padding: 10px 0;">1） 因法律规定，或火把服从行政命令或司法判令的要求。</div>
      <div style="padding: 10px 0;">2） 用户违反本协议。</div>
      <div style="padding: 10px 0;">3）火把认为应予终止的其他情形。</div>
      <div
        style="padding: 10px 0;"
      >在一般情形下，火把会提前按照您提供的联系方式以电子邮件或短信或其他电子方式通知您，服务将中止或终止。您应了解并同意，在紧急情况或特殊情况下，火把可不经通知即中止或终止服务。</div>
      <div style="padding: 10px 0;">在本协议或本协议项下火把提供的服务（含收费服务）中止或终止时，火把有权拒绝用户登录火把；</div>
      <div style="padding: 10px 0;">您同意，不因本协议或本协议项下火把所提供的服务中止或终止，而要求火把向您作出赔偿或补偿或承担任何其他责任。</div>

      <div style="padding: 10px 0;">第十四条 【法律适用】</div>
      <div style="padding: 10px 0;">您在使用火把时，应遵守中华人民共和国法律、及您所在地之法律、及您自愿或应当接收其管辖之法律。</div>
      <div style="padding: 10px 0;">本协议的解释及履行应按照中华人民共和国法律进行。</div>

      <div style="padding: 10px 0;">第十五条 【法律责任】</div>
      <div
        style="padding: 10px 0;"
      >您应就所上传的内容承担全部法律责任；无论前述责任是因侵犯第三方权利所引起的、或因您违反与第三方签订的协议或本协议引起的、或因您违反法律规定引起的；前述责任包括对火把或第三方所承担的民事责任、或行政机关要求承担的行政责任或司法机关要求承担的刑事责任。</div>
      <div
        style="padding: 10px 0;"
      >您同意，如因您违反法律规定或本协议规定给火把造成损失，您将充分赔偿火把所遭受的损失、包括其直接损失、间接损失、预期利益损失等一切损失。</div>
      <div style="padding: 10px 0;">您承诺，如因第三方向您主张权利而导致您承担责任，或您承担行政责任或刑事责任的，您不以此为理由追究火把的责任。</div>
      <div style="padding: 10px 0;">如您应向火把承担责任，前述责任不因本协议或本协议项下的服务被终止而免除。</div>
      <div style="padding: 10px 0;">火把可能不时发布针对用户的相关协议，该相关协议作为对本协议的补充或修改并作为本协议的一部分。请您及时关注并阅读相关协议。</div>

      <div style="padding: 10px 0;">第十七条 【争议解决】</div>
      <div
        style="padding: 10px 0;"
      >您和火把均同意，因本协议解释或执行引起的任何争议，双方应首先友好协商解决。协商不成时，则任一方均可将争议提交杭州仲裁委员会依据其届时有效的仲裁规则以仲裁方式解决。仲裁地点为杭州，仲裁语言为中文。仲裁裁决为终局的，对各方均有法律约束力。</div>
      <div style="padding: 10px 0;">请您再次确认您已全部阅读并充分理解上述协议。</div>
    </div>
    <EazyNav type="brand" :isShow="false"></EazyNav>
  </div>
</template>

<script>
export default {
  data() {
    return {
      type: "prototype",
      checked: true,
    };
  },
  mounted() {
    this.type = this.$route.query.type;
  }
};
</script>

